IDEA StatiCa Open Model
FatigueLoading Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Fatigue loading
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.Load.FatigueLoading
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class FatigueLoading
Public Class FatigueLoading
public ref class FatigueLoading
The FatigueLoading type exposes the following members.
Constructors
Name | Description
FatigueLoading
 Constructor
Top
Properties
Name | Description
MaxLoading
 Max. cyclic loading
MinLoading
 Min. cyclic loading
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.Load Namespace